[{"word":"fame","sentence":"A Man of Wealth and Fame","desc":"the state of being known or talked about by many people, especially on account of notable achievements."}
,{"word":"fledgling","sentence":"to turn their fledgling partnership into the Apple Computer Co.","desc":"a person or organization that is immature, inexperienced, or underdeveloped."}
,{"word":"oversubscribed","sentence":"It would become the most oversubscribed initial public offering","desc":"applied for in greater quantities than are available or expected"}
,{"word":"rental","sentence":"and in the rental house they shared during the Chrisann Brennan crisis","desc":"relating to or available for rent"}
,{"word":"headquartered","sentence":"He joined Apple when it was headquartered in Jobs's garage","desc":"provide (an organization) with headquarters at a specified location"}
,{"word":"cutoff","sentence":"..., which was the cutoff level for options","desc":"a point or level that is a designated limit of something"}
,{"word":"justifiably","sentence":"Even so, he could have justifiably been given \"founder's stock\"","desc":"with good reason."}
,{"word":"nevertheless","sentence":"","desc":"in spite of that; notwithstanding; all the same."}
,{"word":"hovering","sentence":"... by hovering outside his office and catching him ...","desc":"linger close at hand, especially in a hesitant or uncertain manner"}
,{"word":"plea","sentence":"... to make a plea","desc":"a request made in an urgent and emotional manner"}
,{"word":"brushed him off","sentence":"But at each encounter, Jobs brushed him off.","desc":"a rejection or dismissal in which someone(him) is treated as unimportant"}
,{"word":"eligible","sentence":"What was really so difficult for me is that Steve never told me I wasn't eligible","desc":"having the right to do or obtain something; satisfying the appropriate conditions"}
,{"word":"march","sentence":"Kottke worked up the courage to march into Job's office ...","desc":"walk or proceed quickly and with determination"}
,{"word":"hash out","sentence":"... and try to hash out the issue.","desc":"decide on it after a lot of discussion; discuss it thoroughly until they reaching an agreement"}
,{"word":"choked","sentence":"I just got choked up and began to cry ...","desc":"(of a person or animal) have severe difficulty in breathing because of a constricted or obstructed throat or a lack of air"}
,{"word":"beneficiaries","sentence":"Most of his(Woz) beneficiaries made enough to buy a home.","desc":"a person who derives advantage from something, especially a trust, will, or life insurance policy"}
,{"word":"outright","sentence":"He(Woz) also later gave shares outright to employees ...","desc":"1. altogether; completely; 2. without reservation; openly"}
,{"word":"shortchanged","sentence":"... he felt had been shortchanged, including Kottke.","desc":"cheat (someone) by giving insufficient money as change"}
,{"word":"generosity","sentence":"Everyone loved Wozniak, all the more so after his generosity.","desc":"the quality of being kind and generous"}
,{"word":"awfully","sentence":"but many also agreed with Jobs that he was \"awfully naive and childlike\" ","desc":"(used especially in spoken English) very."}
,{"word":"destitute","sentence":"... a destitute man went up ...","desc":"without the basic necessities of life."}
,{"word":"bulletin","sentence":"... on a company bulletin board.","desc":"a short official statement or broadcast summary of news"}
,{"word":"scrawled","sentence":"Someone scrawled on it \"Woz in 1990\".","desc":"write (something) in a hurried, careless way"}
,{"word":"boutique","sentence":"... and the untraditional boutique firm Hambrecht & Quist ...","desc":"a SMALL store selling fashionable clothes or accessories"}
,{"word":"irreverent","sentence":"Steve was very irreverent toward the guys from Morgan Stanley, ...","desc":"showing a lack of respect for people or things that are generally taken seriously."}
,{"word":"uptight","sentence":"... which was a pretty uptight firm in those days.","desc":"anxious or angry in a tense and overly controlled way"}
,{"word":"auction","sentence":"he later went on to formulate the idea of a reverse auction to price shares before an IPO.","desc":"a public sale in which goods or property are sold to the highest bidder"}
,{"word":"antimaterialistic","desc":"","sentence":"He was an antimaterialistic hippie ..."}
,{"word":"capitalized","desc":"","sentence":"... who capitalized on the inventions of a friend who want to give them away for free, ..."}
,{"word":"Zen devotee","desc":"","sentence":"... and he was a Zen devotee ..."}
,{"word":"pilgrimage","desc":"a pilgrim's journey","sentence":"who made a pilgrimage to India"}
,{"word":"weave","desc":"","sentence":"somehow these attitudes seemed to weave togather rather than conflict."}
,{"word":"ostentatious","desc":"characterized by vulgar or pretentious display; designed to impress or attract notice.","sentence":"no matter how rich he became, tended not to be ostentatious ..."}
,{"word":"furnished","desc":"provide (a house or room) with furniture and fittings.","sentence":"... and were furnished so simply they would have put a Shaker to shame."}
,{"word":"entourage","desc":"a group of people attending or surrounding an important person","sentence":"Neither then nor later would he travel with entourage, ..."}
,{"word":"staff","desc":"all the people employed by a particular organization","sentence":"... keep a personal staff, or even have security protection."}
,{"word":"flinty","desc":"(of a person or their expression) very hard and unyielding","sentence":"Like his father, he could be flinty ..."}
,{"word":"bargaining","desc":"negotiate the terms and conditions of a transaction","sentence":"... when bargaining with suppliers, ..."}
,{"word":"craving","desc":"a powerful desire for something","sentence":"... but he didn't allow a craving for profits ..."}
,{"word":"precedence","desc":"the condition of being considered more important than someone or something else; priority in importance, order, or rank","sentence":"... to take precedence over his passion for building great products."}
,{"word":"voluntarily","desc":"","sentence":"I was voluntarily poor when I was in college and India"}
,{"word":"plastic surgery","desc":"","sentence":"Their wives got plastic surgery ..."}
,{"word":"bizarre","desc":"","sentence":"... and turned into these bizarre people."}
,{"word":"philanthropic","desc":"","sentence":"He was not particularly philanthropic."}
,{"word":"foundation","desc":"","sentence":"He briefly set a a foundation."}
,{"word":"philanthropy","desc":"","sentence":"..., who kept talking about \"venture\" philanthropy ..."}
,{"word":"leverage","desc":"","sentence":"... and how to \"leverage\" giving"}
,{"word":"contemptuous","desc":"","sentence":"Jobs became contemptuous of people."}
,{"word":"poverty","desc":"","sentence":"... to fight deseases of poverty."}
,{"word":"solicit","desc":"","sentence":"... to Apple right after its IPO to solicit a donation."}
,{"word":"forthcoming","desc":"","sentence":"Jobs was not forthcoming"}
,{"word":"mortgage","desc":"","sentence":"They sold some to pay off the mortgage on their Los Altos home."}
,{"word":"splurge","desc":"","sentence":"Their only splurge was ..."}
,{"word":"cruise","desc":"","sentence":"... to take a Princess cruise each year."}
,{"word":"decommissioned","desc":"","sentence":"..., because it reminded him of when his Coast Guard ship went throught on its way to San Francisco to be decommissioned."}
,{"word":"proclaimed","desc":"","sentence":"\"This man has changed business forever,\" it proclaimed."}
,{"word":"neatly trimmed","desc":"","sentence":"It showed Jobs with a neatly trimmed beard and well-styled long hair, ..."}
,{"word":"jeans","desc":"","sentence":"... wearing blue jeans and a dress shirt ..."}
,{"word":"blazer","desc":"","sentence":"... with a blazer ..."}
,{"word":"satiny","desc":"","sentence":"... that was a little too satiny."}
,{"word":"mesmerizing","desc":"","sentence":"... and looking directly into the camera with the mesmerizing stare ..."}
,{"word":"picked up","desc":"","sentence":"... he had picked up from Robert Friedland."}
,{"word":"hypnotic","desc":"","sentence":"The cover was a painting of Jobs, again with his hypnotic stare."}
,{"word":"petulant","desc":"(of a person or their manner) childishly sulky or bad-tempered","sentence":"As an executive, Jobs has sometimes been petulant ..."}
,{"word":"harsh,subordinates","desc":"","sentence":"... and harsh on subordinates."}
,{"word":"counterculture","desc":"","sentence":"he still fancied himself a child of the counterculture."}
,{"word":"perched","desc":"","sentence":"he took off his Wilkes Bashford blazer and his shoes, perched on top of a table, ..."}
,{"word":"lotus position","desc":"a cross-legged position for meditation, with the feet resting on the thighs.","sentence":"... and crossed his legs into a lotus position."}
,{"word":"tapered off","desc":"","sentence":"When the business questions tapered off, ..."}
,{"word":"well-groomed","desc":"","sentence":"... Jobs turned the tables on the well-groomed students."}
,{"word":"virgins","desc":"","sentence":"How many of you are virgins?"}
,{"word":"giggles","desc":"","sentence":"There were nervous giggles."}
,{"word":"materialistic,careerist","desc":"","sentence":"who seemed to him more materialistic and careerist than his own."}
,{"word":"purposefulness","desc":"","sentence":"When I went to school, it was right after the sixties and before this general wave of practical purposefulness had set in, ..."}
,{"word":"idealistic","desc":"","sentence":"... Now students aren't even thinking in idealistic terms, or at least nowhere near as much."}
,{"word":"ingrained","desc":"","sentence":"and most of the people I know who are my age have that ingrained in them forever."}
]