[{"word":"malleable", "sentence":"In his presence, reality is malleable."}
,{"word":"acutely", "sentence":"If you feel or notice something acutely, you feel or notice it very strongly."}
,{"word":"dichotomies", "sentence":"Bill Atkinson, the Mac designer who fell on the good side of these dichotomies, described what it was like: ..."}
,{"word":"abusive", "sentence":"Was all of his stormy and abusive behavior necessary? Probably not, nor was it justified."}
,{"word":"adequacy", "sentence":"Adequacy is the quality of being good enough or great enough in amount to be acceptable."}
,{"word":"surrogate", "sentence":"For a while she and Noyce were like a surrogate family."}
,{"word":"carrot", "sentence":"After Jobs decreed that the sodas in the office refrigerator be replaced by Odwalla organic orange and carrot juices, someone on the team had T-shirts made."}
,{"word":"tantrums", "sentence":"he joined Apple in 1980 and served as a calming mother figure who would step in after one of Jobs's tantrums."}
,{"word":"rhetorical", "sentence":"He grimaced slightly, obviously expecting no answer to his rhetorical question."}
,{"word":"ensnare", "sentence":"He was concerned the campaign could ensnare innocent people."}
,{"word":"keen", "sentence":"They described him as a man of keen intellect."}
,{"word":"keen", "sentence":"He had retained a keen interest in the progress of the work."}
,{"word":"audacity", "sentence":"I was shocked at the audacity of the gangsters."}
,{"word":"tactical", "sentence":"It's not yet clear whether his resignation offer is a serious one, or whether it's simply a tactical move."}
,{"word":"envious", "sentence":"I don't think I'm envious of your success."}
,{"word":"impetuous", "sentence":"If you describe someone as impetuous, you mean that they are likely to act quickly and suddenly without thinking or being careful."}
,{"word":"deceive", "sentence":"If you deceive someone, you make them believe something that is not true, usually in order to get some advantage for yourself."}
,{"word":"dazzled", "sentence":"George dazzled her with his knowledge of the world."}
,{"word":"stabs", "sentence":"If someone stabs you, they push a knife or sharp object into your body."}
,{"word":"infused", "sentence":"Many of the girls seemed to be infused with excitement on seeing the snow."}
,{"word":"barge", "sentence":"If you barge into a place or barge through it, you rush or push into it in a rough and rude way."}
,{"word":"barge", "sentence":"Students tried to barge into the secretariat buildings."}
,{"word":"brutalizes", "sentence":"If an unpleasant experience brutalizes someone, it makes them cruel or violent. "}
,{"word":"voltage", "sentence":"The voltage of an electrical current is its force measured in volts."}
,{"word":"polarity", "sentence":"If there is a polarity between two people or things, they are completely different from each other in some way."}
,{"word":"abiding", "sentence":"An abiding feeling, memory, or interest is one that you have for a very long time."}
,{"word":"lure", "sentence":"To lure someone means to trick them into a particular place or to trick them into doing something that they should not do."}
,{"word":"lure", "sentence":"A lure is an attractive quality that something has, or something that you find attractive."}
,{"word":"deft", "sentence":"A deft action is skilful and often quick."}
,{"word":"spike", "sentence":"A spike is a long piece of metal with a sharp point."}
,{"word":"decrees", "sentence":"If someone in authority decrees that something must happen, they decide or state this officially."}
,{"word":"pirouette", "sentence":"A pirouette is a movement in ballet dancing. The dancer stands on one foot and spins their body around fast."}
,{"word":"attuned", "sentence":"If you are attuned to something, you can understand and appreciate it."}
,{"word":"uncanny", "sentence":"If you describe something as uncanny, you mean that it is strange and difficult to explain."}
,{"word":"amplitude", "sentence":"In physics, the amplitude of a sound wave or electrical signal is its strength. "}
,{"word":"comport", "sentence":"If you comport yourself in a particular way, you behave in that way."}
,{"word":"toady", "sentence":"If you refer to someone as a toady, you disapprove of them because they flatter or are nice to an important or powerful person in the hope of getting some advantage from them."}
]