[
{"word":"fame","sentence":"A Man of Wealth and Fame","desc":"the state of being known or talked about by many people, especially on account of notable achievements."}
,{"word":"fledgling","sentence":"to turn their fledgling partnership into the Apple Computer Co.","desc":"a person or organization that is immature, inexperienced, or underdeveloped."}
,{"word":"oversubscribed","sentence":"It would become the most oversubscribed initial public offering","desc":"applied for in greater quantities than are available or expected"}
,{"word":"rental","sentence":"and in the rental house they shared during the Chrisann Brennan crisis","desc":"relating to or available for rent"}
,{"word":"headquartered","sentence":"He joined Apple when it was headquartered in Jobs's garage","desc":"provide (an organization) with headquarters at a specified location"}
,{"word":"cutoff","sentence":"..., which was the cutoff level for options","desc":"a point or level that is a designated limit of something"}
,{"word":"justifiably","sentence":"Even so, he could have justifiably been given \"founder's stock \\","desc":"with good reason."}
,{"word":"nevertheless","sentence":"","desc":"in spite of that; notwithstanding; all the same."}
,{"word":"hovering","sentence":"... by hovering outside his office and catching him ...","desc":"linger close at hand, especially in a hesitant or uncertain manner"}
,{"word":"plea","sentence":"... to make a plea","desc":"a request made in an urgent and emotional manner"}
,{"word":"brush him off","sentence":"But at each encounter, Jobs brushed him off.","desc":"a rejection or dismissal in which someone(him) is treated as unimportant"}
,{"word":"eligible","sentence":"What was really so difficult for me is that Steve never told me I wasn't eligible","desc":"having the right to do or obtain something; satisfying the appropriate conditions"}
,{"word":"march","sentence":"Kottke worked up the courage to march into Job's office ...","desc":"walk or proceed quickly and with determination"}
,{"word":"hash out","sentence":"... and try to hash out the issue.","desc":"decide on it after a lot of discussion; discuss it thoroughly until they reaching an agreement"}
,{"word":"choked","sentence":"I just got chocked up and began to cry ...","desc":"(of a person or animal) have severe difficulty in breathing because of a constricted or obstructed throat or a lack of air"}
,{"word":"beneficiaries","sentence":"Most of his(Woz) beneficiaries made enough to buy a home.","desc":"a person who derives advantage from something, especially a trust, will, or life insurance policy"}
,{"word":"outright","sentence":"He(Woz) also later gave shares outright to employees ...","desc":"1. altogether; completely; 2. without reservation; openly"}
,{"word":"shortchanged","sentence":"... he felt had been shortchanged, including Kottke.","desc":"cheat (someone) by giving insufficient money as change"}
,{"word":"generosity","sentence":"Everyone loved Wozniak, all the more so after his generosity.","desc":"the quality of being kind and generous"}
,{"word":"awfully","sentence":"but many also agreed with Jobs that he was \"awfully naive and childlike\" ","desc":"(used especially in spoken English) very."}
,{"word":"destitute","sentence":"... a destitute man went up ...","desc":"without the basic necessities of life."}
,{"word":"bulletin","sentence":"... on a company bulletin board.","desc":"a short official statement or broadcast summary of news"}
,{"word":"scrawled","sentence":"Someone scrawled on it \"Woz in 1990\".","desc":"write (something) in a hurried, careless way"}
,{"word":"boutique","sentence":"... and the untraditional boulique firm Hambrecht & Quist ...","desc":"a SMALL store selling fashionable clothes or accessories"}
,{"word":"irreverent","sentence":"Steve was very irreverent toward the guys from Morgan Stanley, ...","desc":"showing a lack of respect for people or things that are generally taken seriously."}
,{"word":"uptight","sentence":"... which was a pretty uptight firm in those days.","desc":"anxious or angry in a tense and overly controlled way"}
,{"word":"auction","sentence":"he later went on to formulate the idea of a reverse auction to price shares before an IPO.","desc":"a public sale in which goods or property are sold to the highest bidder"}
]