[
{"word":"frizzy","sentence":"Monica still has her big, frizzy hair.","desc":""},
{"word":"crushed,turn-on,chest","sentence":"Monica: Oh, the way you crushed Mike at ping pong was such a turn-on.You wanna...? (plays with her finger on Chandlers chest)","desc":""},
{"word":"pillowcase","sentence":"Monica: I'll put a pillowcase over my head.","desc":""},
{"word":"slamming","sentence":"(there's a door slamming in Ross's room, and some indistinct murmuring)","desc":""},
{"word":"triceps","sentence":"Chandler: He could be alone. This morning I heard him do push-ups, and then talk to his triceps.","desc":""},
{"word":"tart,floozy,giant","sentence":"Phoebe: Oh that tart... floozy... giant...","desc":""},
{"word":"eavesdrop","sentence":"I'm not gonna eavesdrop on my friend.","desc":""},
{"word":"sprint","sentence":"(Chandler and Monica take a sprint to the other wall)","desc":""},
{"word":"yelling","sentence":"In the rooms next door, Joey, Rachel, Ross and Charlie stop kissing and try to understand what the yelling was about. After a while they continue kissing.","desc":""},
{"word":"stuffed","sentence":"We're back in Chandler and Monica's room. Monica has some of her own hair stuffed in her mouth by Chandler.","desc":""},
{"word":"muffled","sentence":"Monica: (muffled) Thank you.","desc":""},
{"word":"manning","sentence":"Chandler: How about the dinosaur twins in the other room? No-one is manning that wall!","desc":""},
{"word":"curtains","sentence":"Monica: I think I hear curtains closing...","desc":""},
{"word":"kicked off","sentence":"Phoebe: We've got shoes being kicked off over here.","desc":""},
{"word":"Buckwheat","sentence":"Chandler: Okay Buckwheat!","desc":""},
{"word":"bedspread,infra red","sentence":"Charlie: Ooh... Is it because of what might be on the bedspread, because I saw that news report too, with the infra red and the ... I could just...","desc":""},
{"word":"gonna,twitches","sentence":"Ross: Alright, I'm gonna go find them... (twitches a bit, looks down) I just need a... need a before I can... you know. ","desc":""},
{"word":"resort","sentence":"I love you... Paradise Hotel, Golf resort and Spa...","desc":""},
{"word":"caresses","sentence":"Chandler: (caresses the wall with his finger) Bye!","desc":""},
{"word":"hanging out,nonchalant","sentence":"For all he knows we're just hanging out together. Right? Just be nonchalant.","desc":""},
{"word":"pouted","sentence":"oey like stands at attention with his chest forward and his hands on his sides, looking up at the ceiling with his lips pouted.","desc":""},
{"word":"inbetween,grabs","sentence":"Chandler opens the door inbetween the rooms, grabs Joey by his shirt and drags him to his room, and closes the door again","desc":""},
{"word":"corridor","sentence":"Rachel: Yeah, sure... (looks outside into the corridor if Joey is there)","desc":""},
{"word":"hesitates","sentence":"he hesitates seeing himself in the mirror, but still puts his ear against it. ","desc":""}
]