[
{"word":"run","sentence":"I run a marathon twice a year. (run)"},
{"word":"ran","sentence":"I ran a marathon last year. (run)"},
{"word":"will run","sentence":"I will run a marathon next year. (run)"},
{"word":"eat","sentence":"I eat lunch in my office. (eat)"},
{"word":"ate","sentence":"I ate lunch an hour ago. (eat)"},
{"word":"will eat","sentence":"I will eat lunch in one hour. (eat)"},
{"word":"see","sentence":"I see a movie once a week. (see)"},
{"word":"saw","sentence":"I saw a movie yesterday. (see)"},
{"word":"will see","sentence":"I will see a movie tomorrow. (see)"},
{"word":"know","sentence":"I know it. (know)"},
{"word":"knew","sentence":"I knew it the day before yesterday. (know)"},
{"word":"will know","sentence":"I will know it by tomorrow. (know)"},
{"word":"learn","sentence":"I learn English. (learn)"},
{"word":"learned","sentence":"I learned English the last two years. (learn)"},
{"word":"will learn","sentence":"I will learn English next year. (learn)"},
{"word":"cook","sentence":"I cook my supper every night. (cook)"},
{"word":"cooked","sentence":"I cooked our dinner already. (cook)"},
{"word":"will cook","sentence":"I will cook breakfast tomorrow. (cook)"},
{"word":"have run","sentence":"I have run several marathons this year. (run)"},
{"word":"had run","sentence":"I had run many marathons in the past. (run)"},
{"word":"will have run","sentence":"I will have run a marathon by the time I turn 30. (run)"},
{"word":"have learned","sentence":"I have learned a lot about English grammar this semester. (learn)"},
{"word":"had learned","sentence":"I had learned the basics of English grammar in elementary school. (learn)"},
{"word":"will have learned","sentence":"I will have learned a lot about English grammar when I finish college. (learn)"},
{"word":"have known","sentence":"I have known her since I was young. (know)"},
{"word":"had known","sentence":"I had known her until she passed away. (know)"},
{"word":"will have known","sentence":"I will have known her for 20 years next month. (know)"},
{"word":"have cooked","sentence":"I have cooked supper every night this week. (cook)"},
{"word":"had cooked","sentence":"I had cooked supper every night until the stove broke. (cook)"},
{"word":"will have cooked","sentence":"I will have cooked supper every night by the time this diet ends. (cook)"},
{"word":"has been raining","sentence":"It has been raining, and the street is still wet. (rain)"},
{"word":"have been running","sentence":"I have been running, and I am still tired. (run)"},
{"word":"has been practicing","sentence":"She has been practicing the piano, and she is much better now. (practice)"},
{"word":"had been raining","sentence":"It had been raining, and the street was still wet. (rain)"},
{"word":"had been running","sentence":"I had been running, and I was still tired. (run)"},
{"word":"had been practicing","sentence":"She had been practicing the piano, and she had gotten much better. (practice)"},
{"word":"will have been raining","sentence":"By tonight, it will have been raining several hours, and the street will be very wet. (rain)"},
{"word":"will have been running","sentence":"By next summer, I will have been running for almost a year, and I will be fit and healthy. (run)"},
{"word":"will have been practicing","sentence":"By the time of the concert, she will have been practicing the piano for several months, and she will be much better. (practice)"}
]