[
{"word":"probe into","sentence":"So on this, my second day of sight, I should try to probe into the soul of man through his art."},
{"word":"splendid,Italian Primitives,religious devotion,feverish visions","sentence":"More splendid still, the whole magnificent world of painting would be opened to me, from the Italian Primitives, with their serene religious devotion, to the Moderns, with their feverish visions."},
{"word":"canvases","sentence":"I should look deep into the canvases of Raphael, Leonardo da Vinci, Titian, Rembrandt."},
{"word":"feast,mysteries","sentence":"I should want to feast my eyes upon the warm colors of Veronese, study the mysteries of El Greco, catch a new vision of Nature from Corot."},
{"word":"temple,fraction","sentence":"Upon my short visit to this temple of art I should not be able to review a fraction of that great world of art which is open to you."},
{"word":"superficial","sentence":"I should be able to get only a superficial impression."},
{"word":"merits,composition","sentence":"One must learn through experience to weigh the merits of line, of composition, of form and color."},
{"word":"embark upon,fascinating,unilluminated","sentence":"If I had eyes, how happily would I embark upon so fascinating a study! Yet I am told that, to many of you who have eyes to see, the world of art is a dark night, unexplored and unilluminated."},
{"word":"extreme reluctance,neglected","sentence":"It would be with extreme reluctance that I should leave the Metropolitan Museum, which contains the key to beauty -- a beauty so neglected."},
{"word":"shelves","sentence":"The same key lies waiting in smaller museums, and in books on the shelves of even small libraries."},
{"word":"theatre","sentence":"The evening of my second day of sight I should spend at a theatre or at the movies."},
{"word":"theatrical,companion","sentence":"Even now I often attend theatrical performances of all sorts, but the action of the play must be spelled into my hand by a companion. "},
{"word":"confronted,many-horned dilemma","sentence":"I should be confronted by a many-horned dilemma, for there are scores of plays I should want to see."},
{"word":"gaze,spectacle,miracle,grace","sentence":"How many of you, I wonder, when you gaze at a play, a movie, or any spectacle, realize and give thanks for the miracle of sight which enables you to enjoy its color, grace, and movement?"},
{"word":"rhythmic,restricted,dimly,delight,vibrates","sentence":"I cannot enjoy the beauty of rhythmic movement except in a sphere restricted to the touch of my hands. I can vision only dimly the grace of a Pavlowa, although I know something of the delight of rhythm, for often I can sense the beat of music as it vibrates through the floor."},
{"word":"cadenced,sculptured marble,acute,thrill","sentence":"I can well imagine that cadenced motion must be one of the most pleasing sights in the world. I have been able to gather something of this by tracing with my fingers the lines in sculptured marble; if this static grace can be so lovely, how much more acute must be the thrill of seeing grace in motion."},
{"word":"meagre glimpse","sentence":"I was able to catch thus a meagre glimpse of the world of drama, and I shall never forget the delight of that moment."},
{"word":"derive from,interplay,dramatic performance","sentence":"But, oh, how much I must miss, and how much pleasure you seeing ones can derive from watching and hearing the interplay of speech and movement in the unfolding of a dramatic performance!"},
{"word":"dramatic literature","sentence":"So, through the evening of my second imaginary day of sight, the great figures of dramatic literature would crowd sleep from my eyes."}
]