[
{"word":"illustrate","sentence":"Perhaps I can best illustrate by imagining what I should most like to see ..."},
{"word":"intervening","sentence":"those three precious intervening days"},
{"word":"gaze,rest upon","sentence":"What would you most want to let your gaze rest upon?"},
{"word":"dear","sentence":"the things which have become dear to me"},
{"word":"loomed","sentence":"the night that loomed before you"},
{"word":"granted,relapse,divide","sentence":"If, by some miracle, I were granted three seeing days, to be followed by a relapse into darkness, I should divide the period into three parts."},
{"word":"cherish","sentence":"I could cherish it in my memory"},
{"word":"sympathetic tenderness,with,accomplished","sentence":"the living evidence of the sympathetic tenderness and patience with which she accomplished the difficult task of my education"},
{"word":"compassion,revealed","sentence":"that compassion for all humanity which she has revealed to me so often"},
{"word":"personalities","sentence":"picture their personalities by touch"},
{"word":"reactions","sentence":"through watching their reactions to ..."},
{"word":"noting,fleeting,countenance","sentence":"through noting the immediate and fleeting reactions of their eyes and countenance"},
{"word":"casual,impression,handclasp,tap,palm","sentence":"but of casual friends I have only an incomplete impression, an impression gained from a handclasp, from spoken words which I take from their lips with my finger tips, or which they tap into the palm of my hand."},
{"word":"satisfying,grasp,essential,subtleties,expression,quiver,flutter","sentence":"How much easier, how much more satisfying it is for you who can see to grasp quickly the essential qualities of another person by watching the subtleties of expression, the quiver of a muscle, the flutter of a hand. "},
{"word":"occur to,acquaintance,casually","sentence":"But does it ever occur to you to use your sight to see into the inner nature of a friend or acquaintance? Do not most of you seeing people grasp casually the outward features of a face and let it go at that?"},
{"word":"long standing,wives,embarrassed,confusion","sentence":"I have questioned husbands of long standing about the color of their wives' eyes, and often they express embarrassed confusion and admit that they do not know."},
{"word":"incidentally,chronic,complaint,notice,household arrangements","sentence":"And, incidentally, it is a chronic complaint of wives that their husbands do not notice new dresses, new hats, and changes in household arrangements."},
{"word":"startling,spectacular","sentence":"and they actually see only the startling and spectacular. But even in viewing the most spectacular sights the eyes are lazy"},
{"word":"Court records,inaccurately,eyewitnesses","sentence":"Court records reveal every day how inaccurately \"eyewitnesses\" see. "},
{"word":"imprinting","sentence":"imprinting upon my mind the outward evidences of the beauty that is within them"},
{"word":"eager,precedes,consciousness,conflicts","sentence":"the eager, innocent beauty which precedes the individual's consciousness of the conflicts which life develops"},
{"word":"loyal,trusting,canny,stalwart,tender,comforting","sentence":"And I should like to look into the loyal, trusting eyes of my dogs -- the grave, canny little Scottie, Darkie, and the stalwart, understanding Great Dane, Helga, whose warm, tender, and playful friendships are so comforting to me."},
{"word":"intimate,trifles","sentence":"the intimate trifles that transform a house into home"},
{"word":"intoxicate,desperately,unfolding","sentence":"intoxicate my eyes on the beauties of the world of Nature, trying desperately to absorb in a few hours the vast splendor which is constantly unfolding itself to those who can see."},
{"word":"jaunt,ploughing,tractor,serene,glory","sentence":"On the way home from my woodland jaunt my path would lie near a farm so that I might see the patient horses ploughing in the field (perhaps I should see only a tractor!) and the serene content of men living close to the soil. And I should pray for the glory of a colorful sunset."}
]