[
    {"word":"coined","sentence":"The name machine learning was coined in 1959 by Arthur Samuel.","desc":"创造新词"},
    {"word":"quoted,formal,with respect to,performance,measured","sentence":"Tom M. Mitchell provided a widely quoted, more formal definition of the algorithms studied in the machine learning field: \"A computer program is said to learn from experience E with respect to some class of tasks T and performance measure P if its performance at tasks in T, as measured by P, improves with experience E.\"","desc":""},
    {"word":"concerned,fundamentally,cognitive terms","sentence":"This definition of the tasks in which machine learning is concerned offers a fundamentally operational definition rather than defining the field in cognitive terms.","desc":"机器学习关心的任务；提供一个关于行为的，而不是关于认知的基本定义"},
    {"word":"supervised learning,desired outputs","sentence":"In supervised learning, the algorithm builds a mathematical model of a set of data that contains both the inputs and the desired outputs.","desc":"监督式学习"},
    {"word":"spam,prediction,represented","sentence":"For an algorithm that identifies spam emails, the output would be the prediction of either \"spam\" or \"not spam\", represented by the Boolean values one and zero.","desc":"预测、识别垃圾邮件"},
    {"word":"Regression,continuous outputs,within a range","sentence":" Regression algorithms are named for their continuous outputs, meaning they may have any value within a range.","desc":"回归算法"},
    {"word":"unsupervised,mathematical model","sentence":"In unsupervised learning, the algorithm builds a mathematical model of a set of data which contains only inputs and no desired outputs. ","desc":"无监督式学习，数学模型"},
    {"word":"Dimensionality reduction,reducing","sentence":"Dimensionality reduction is the process of reducing the number of \"features\", or inputs, in a set of data.","desc":"降维"},
    {"word":"Reinforcement,dynamic environment,autonomous,opponent","sentence":"Reinforcement learning algorithms are given feedback in the form of positive or negative reinforcement in a dynamic environment, and are used in autonomous vehicles or in learning to play a game against a human opponent.","desc":"增强学习；自主驾驶"},
    {"word":"unobservable,probability density function,density estimation,inductive bias,robotics,curriculum,cumulatively,guidance mechanisms,maturation,motor synergies,imitation","sentence":"Machine learning algorithms can be used to find the unobservable probability density function in density estimation problems. Meta learning algorithms learn their own inductive bias based on previous experience. In developmental robotics, robot learning algorithms generate their own sequences of learning experiences, also known as a curriculum, to cumulatively acquire new skills through self-guided exploration and social interaction with humans. These robots use guidance mechanisms such as active learning, maturation, motor synergies, and imitation.","desc":""}
]