[
{"word":"handover,overall,throughput,latency","sentence":"it reduces the overhead of thread-to-thread handover and buffering, and increases overall throughput while decreasing latency."},
{"word":"exchange","sentence":"The TaskManagers (also called workers) execute the tasks (or more specifically, the subtasks) of a dataflow, and buffer and exchange the data streams."},
{"word":"standalone","sentence":"The JobManagers and TaskManagers can be started in various ways: directly on the machines as a standalone cluster, in containers, or managed by resource frameworks like YARN or Mesos."},
{"word":"slots","sentence":"To control how many tasks a worker accepts, a worker has so called task slots (at least one)."},
{"word":"dedicate","sentence":"A TaskManager with three slots, for example, will dedicate 1/3 of its managed memory to each slot."},
{"word":"isolation","sentence":"Note that no CPU isolation happens here; currently slots only separate the managed memory of tasks."},
{"word":"multiplexing","sentence":"Tasks in the same JVM share TCP connections (via multiplexing) and heartbeat messages."},
{"word":"even if","sentence":"By default, Flink allows subtasks to share slots even if they are subtasks of different tasks, so long as they are from the same job."},
{"word":"utilization","sentence":"It is easier to get better resource utilization."},
{"word":"non-intensive,resource intensive","sentence":"Without slot sharing, the non-intensive source/map() subtasks would block as many resources as the resource intensive window subtasks."},
{"word":"yields,utilization,fairly","sentence":"With slot sharing, increasing the base parallelism in our example from two to six yields full utilization of the slotted resources, while making sure that the heavy subtasks are fairly distributed among the TaskManagers."},
{"word":"point-in-time snapshot","sentence":"the state backends also implement the logic to take a point-in-time snapshot of the key/value state and store that snapshot as part of a checkpoint."},
{"word":"discarded","sentence":"For recovery only the last completed checkpoint is needed and older checkpoints can be safely discarded as soon as a new one is completed."},
{"word":"periodic,expire","sentence":"Savepoints are similar to these periodic checkpoints except that they are triggered by the user and don’t automatically expire when newer checkpoints are completed."}
]