[
{"word":"greet,dawn","sentence":"The following morning, I should again greet the dawn, anxious to discover new delights, ","desc":""},
{"word":"perpetually,revelation","sentence":"the dawn of each day must be a perpetually new revelation of beauty.","desc":""},
{"word":"animate,inanimate","sentence":"The first day I devoted to my friends, animate and inanimate.","desc":""},
{"word":"amid,haunts","sentence":"amid the haunts of men going about the business of life.","desc":""},
{"word":"suburb","sentence":"I start from my home in the quiet little suburb of Forest Hills, Long Island.","desc":""},
{"word":"neat,toil","sentence":"Here, surrounded by green lawns, trees, and flowers, are neat little houses, happy with the voices and movements of wives and children, havens of peaceful rest for men who toil in the city. ","desc":""},
{"word":"lacy,steel,startling,ingenuity","sentence":"I drive across the lacy structure of steel which spans the East River, and I get a new and startling vision of the power and ingenuity of the mind of man.","desc":""},
{"word":"chug,scurry,racy,stolid,snorting tugs","sentence":"Busy boats chug and scurry about the river -- racy speed boats, stolid, snorting tugs.","desc":""},
{"word":"awe-inspiring,glittering spires","sentence":"What an awe-inspiring sight, these glittering spires, these vast banks of stone and steel -- structures such as the gods might build for themselves!","desc":""},
{"word":"magnificent","sentence":"Their eyes are blind to this magnificent sight because it is so familiar to them.","desc":""},
{"word":"secretary","sentence":"I \"saw\" the city below through the eyes of my secretary.","desc":""},
{"word":"stroll down","sentence":"I stroll down Fifth Avenue.","desc":""},
{"word":"seething","sentence":"so that I see no particular object but only a seething kaleidoscope of color.","desc":""},
{"word":"throng,gorgeous spectacle,tire","sentence":"I am certain that the colors of women's dresses moving in a throng must be a gorgeous spectacle of which I should never tire.","desc":""},
{"word":"mass","sentence":"too interested in styles and the cut of individual dresses to give much attention to the splendor of color in the mass.","desc":""},
{"word":"inveterate,myraid","sentence":"that I should become an inveterate window shopper, for it must be a delight to the eye to view the myriad articles of beauty on display.","desc":""},
{"word":"slums","sentence":"From Fifth Avenue I make a tour of the city -- to Park Avenue, to the slums, to factories, to parks where children play.","desc":""},
{"word":"abroad,quarters","sentence":"I take a stay-at-home trip abroad by visiting the foreign quarters. ","desc":""},
{"word":"misery,probe","sentence":"Always my eyes are open wide to all the sights of both happiness and misery so that I may probe deep and add to my understanding of how people work and live.","desc":""},
{"word":"trifle","sentence":"My eye passes lightly over no single trifle","desc":""},
{"word":"miserably pathetic","sentence":"Some sights are pleasant, filling the heart with happiness; but some are miserably pathetic.","desc":""},
{"word":"hilariously,overtones,comedy","sentence":"but I am afraid that on the evening of that last day I should again run away to the theatre, to a hilariously funny play, so that I might appreciate the overtones of comedy in the human spirit.","desc":""},
{"word":"respite,cease","sentence":"At midnight my temporary respite from blindness would cease, and permanent night would close in on me again.","desc":""},
{"word":"descended","sentence":"Only when darkness had again descended upon me should I realize how much I had left unseen.","desc":""},
{"word":"glorious","sentence":"But my mind would be so crowded with glorious memories that I should have little time for regrets.","desc":""},
{"word":"Thereafter","sentence":"Thereafter the touch of every object would bring a glowing memory of how that object looked.","desc":""},
{"word":"programme","sentence":"Perhaps this short outline of how I should spend three days of sight does not agree with the programme you would set for yourself if you knew that you were about to be stricken blind.","desc":""},
{"word":"embrace","sentence":"Your eyes would touch and embrace every object that came within your range of vision.","desc":""},
{"word":"hint","sentence":"I who am blind can give one hint to those who see","desc":""},
{"word":"admonition","sentence":"one admonition to those who would make full use of the gift of sight:","desc":""},
{"word":"mighty strains,orchestra","sentence":"the mighty strains of an orchestra, as if you would be stricken deaf tomorrow.","desc":""},
{"word":"tactile","sentence":"Touch each object you want to touch as if tomorrow your tactile sense would fail.","desc":""},
{"word":"perfume,relish,morsel","sentence":"Smell the perfume of flowers, taste with relish each morsel, as if tomorrow you could never smell and taste again.","desc":""}
]