[
{"word":"thrilling,which","sentence":"All of us have read thrilling stories in which the hero had only a limited and specified time to live."},
{"word":"discovering,doomed","sentence":"But always we were interested in discovering just how the doomed man chose to spend his last days or his last hours."},
{"word":"condemned criminals,sphere of activities,delimited","sentence":"I speak, of course, of free men who have a choice, not condemned criminals whose sphere of activities is strictly delimited."},
{"word":"wondering,under,crowd,mortal,should,regrets","sentence":"Such stories set us thinking, wondering what we should do under similar circumstances. What events, what experiences, what associations, should we crowd into those last hours as mortal beings? What happiness should we find in reviewing the past, what regrets?"},
{"word":"vigor,keenness,stretches,panorama","sentence":"We should live each day with a gentleness, a vigor, and a keenness of appreciation which are often lost when time stretches before us in the constant panorama of more days and months and years to come. "},
{"word":"adopt,epicurean motto,chastened,impending","sentence":"There are those, of course, who would adopt the epicurean motto of 'Eat, drink, and be merry,' but most people would be chastened by the certainty of impending death."},
{"word":"noted,mellow,sweetness","sentence":"It has often been noted that those who live, or have lived, in the shadow of death bring a mellow sweetness to everything they do."},
{"word":"granted,buoyant,vista,listless,go about","sentence":"Most of us, however, take life for granted. We know that one day we must die, but usually we picture that day as far in the future. When we are in buoyant health, death is all but unimaginable. We seldom think of it. The days stretch out in an endless vista. So we go about our petty tasks, hardly aware of our listless attitude toward life."},
{"word":"lethargy,characterizes,facilities,blessings,observation,impairment,blessed,faculties,hazily,concentration,appreciation,grateful,conscious","sentence":"The same lethargy, I am afraid, characterizes the use of all our facilities and senses. Only the deaf appreciate hearing, only the blind realize the manifold blessings that lie in sight. Particularly does this observation apply to those who have lost sight and hearing in adult life. But those who have never suffered impairment of sight or hearing seldom make the fullest use of these blessed faculties. Their eyes and ears take in all sights and sounds hazily, without concentration and with little appreciation. It is the same old story of not being grateful for what we have until we lose it, of not being conscious of health until we are ill."},
{"word":"incredulous,accustomed,convinced","sentence":"I might have been incredulous had I not been accustomed to such responses, for long ago I became convinced that the seeing see little."},
{"word":"delicate symmetry,birch,shaggy,bark,pine,bud,awakening","sentence":"I feel the delicate symmetry of a leaf. I pass my hands lovingly about the smooth skin of a silver birch, or the rough, shaggy bark of a pine. In spring I touch the branches of trees hopefully in search of a bud, the first sign of awakening Nature after her winter's sleep."},
{"word":"velvety,texture,convolutions,miracle,revealed,Occasionally,fortunate,quiver","sentence":"I feel the delightful, velvety texture of a flower, and discover its remarkable convolutions; and something of the miracle of Nature is revealed to me. Occasionally, if I am very fortunate, I place my hand gently on a small tree and feel the happy quiver of a bird in full song."},
{"word":"brook,lush carpet,spongy grass,luxurious Persian rug,pageant,drama","sentence":"I am delighted to have the cool waters of a brook rush through my open fingers. To me a lush carpet of pine needles or spongy grass is more welcome than the most luxurious Persian rug. To me the pageant of seasons is a thrilling and unending drama, the action of which streams through my finger tips."},
{"word":"pity,convenience,fullness","sentence":"...,but it is a great pity that in the world of light the gift of sight is used only as a mere convenience rather than as a means of adding fullness to life."},
{"word":"president,compulsory,professor,pupils,unnoticed,dormant,sluggish,faculties","sentence":"If I were the president of a university I should establish a compulsory course in 'How to Use Your Eyes'. The professor would try to show his pupils how they could add joy to their lives by really seeing what passes unnoticed before them. He would try to awake their dormant and sluggish faculties."}

]