[
{"word":"behold,awe,magnificent","sentence":"I should behold with awe the magnificent panorama of light with which the sun awakens the sleeping earth.","desc":""},
{"word":"devote to,hasty glimpse","sentence":"This day I should devote to a hasty glimpse of the world, past and present.","desc":""},
{"word":"kaleidoscope","sentence":"..., the kaleidoscope of the ages","desc":""},
{"word":"compressed,museums","sentence":"How can so much be compressed into one day? Through the museums, of course.","desc":""},
{"word":"exhibited,condensed,inhabitants,gigantic carcasses,dinosaurs,mastodons,roamed,stature,conquer","sentence":"Often I have visited the New York Museum of Natural History to touch with my hands many of the objects there exhibited, but I have longed to see with my eyes the condensed history of the earth and its inhabitants displayed there -- animals and the races of men pictured in their native environment; gigantic carcasses of dinosaurs and mastodons which roamed the earth long before man appeared, with his tiny stature and powerful brain, to conquer the animal kingdom;","desc":""},
{"word":"fruitful,imaginary,hasty glimpse","sentence":"You who see can spend many fruitful days there, but I, with my imaginary three days of sight, could only take a hasty glimpse, and pass on.","desc":""},
{"word":"Metropolitan,reveals,myriad facets","sentence":"My next stop would be the Metropolitan Museum of Art, for just as the Museum of Natural History reveals the material aspects of the world, so does the Metropolitan show the myriad facets of the human spirit.","desc":""},
{"word":"Throughout,urge,shelter,procreation","sentence":"Throughout the history of humanity the urge to artistic expression has been almost as powerful as the urge for food, shelter, and procreation.","desc":""},
{"word":"chambers,unfolded,Egypt,Greece,Rome","sentence":"And here, in the vast chambers of the Metropolitan Museum, is unfolded before me the spirit of Egypt, Greece, and Rome, as expressed in their art.","desc":""},
{"word":"sculptured,goddesses,ancient,Nile,Parthenon friezes,rhythmic,Athenian,warriors","sentence":"I know well through my hands the sculptured gods and goddesses of the ancient Nile land. I have felt copies of Parthenon friezes, and I have sensed the rhythmic beauty of charging Athenian warriors.","desc":""},
{"word":"Apollos,Venuses,Winged Victory of Samothrace,gnarled,bearded,Homer","sentence":"Apollos and Venuses and the Winged Victory of Samothrace are friends of my finger tips. The gnarled, bearded features of Homer are dear to me, for he, too, knew blindness.","desc":""},
{"word":"lingered,marble,Roman,generations","sentence":"My hands have lingered upon the living marble of Roman sculpture as well as that of later generations. ","desc":""},
{"word":"plaster,Michelangelo,heroic,Moses,Rodin,awed,Gothic,carving","sentence":"I have passed my hands over a plaster cast of Michelangelo's inspiring and heroic Moses; I have sensed the power of Rodin; I have been awed by the devoted spirit of Gothic wood carving.","desc":""},
{"word":"admire,Greek,figured decorations","sentence":"I can admire the simple lines of a Greek vase, but its figured decorations are lost to me.","desc":""}
]

